const hometask = `1. Створити функцію myMap яка буде повторювати функціонал методу масиву .map
Допускається першим елементом передавати масив.
Опціонально, створити myMap як метод класу Array який буде працювати аналогічно map.

2. Створити функцію з колбеком для генерування знижки, яка поверне свій результат в колбек через 50мс.
Згенерувати знижку випадковим чином в діапазоні від 1 до 99%.
Оскільки магазин не може собі дозволити великі знижки, то якщо знижка буде більше 20 (включно), 
функція поверне помилку, інакше поверне значення знижки.
Створити обгортки над функцією з колбеком для полегшення роботи з асинхронними функціями. 
Обгортки мають бути реалізовані двома способами.

3. Створити роут та відповідний контролер для розрахунку знижки для кожного товару, що знаходиться 
в файлі json та вивести товари в однаковому для всіх вигляді разом зі знижкою, використовуючи myMap.
Знижка повинна бути для всіх товарів.
Для товарів типу “hat” діє подвійна знижка (згенерувати двічі, знижка множиться).
Для товарів типу “hat” і кольору “red” – потрійна знижка (згенерувати тричі, знижка перемножується). 

4. Реалізувати пункт 3. трьома способами( callback, promise, async/await), відповідно на кожен 
окремий роут.
Для callback способу викликати функцію написану як callback.
Для Promise та Async/Await способу викликати функцію - обгортку для callback.`;

console.log(hometask);
